In [1]:
import pandas as ka #source code untuk cek version
import numpy as ii

print(ka.__version__)
print(ii.__version__)

1.1.3
1.19.2

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = ka.DataFrame(ii.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)
df.head()

    A   B   C   D   E
0  12   7   8   6  17
1   4   2  14  10  12
2   4  17   8  12   9
3   9  16   7  18   3
4  17  15  12   4   7

In [4]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A   B  C   D   E
0  12   7  8   6  17
2   4  17  8  12   9
3   9  16  7  18   3

In [5]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1   4   2  14  10  12
2   4  17   8  12   9
4  17  15  12   4   7

In [7]:
df_inner = ka.merge(df1, df2, how='inner')
df_inner

   A   B  C   D  E
0  4  17  8  12  9

In [9]:
df_outer = ka.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0  12   7   8   6  17
1   4  17   8  12   9
2   9  16   7  18   3
3   4   2  14  10  12
4  17  15  12   4   7